app/controllers/articles_controller.rb

  def show
    @article = Article.find(params[:id])
---
SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT 1  [["id", 1]]

  def create
    @article = Article.new
    @article.title = params[:title]
    @article.description = params[:description]
    @article.save
---
INSERT INTO "articles" ("title", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "My article title"], ["description", "My article description"], ["created_at", "2020-10-08 16:17:25.976553"], ["updated_at", "2020-10-08 16:17:25.976553"]]

  def update
    @article = select_article
    @article.update(title: params[:article][:title], description: params[:article][:description])
---
UPDATE "articles" SET "title" = ?, "description" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["title", nil], ["description", nil], ["updated_at", "2020-10-08 16:25:56.288373"], ["id", 1]]